Output from Terraform plan before Apply
```[command]/home/runner/work/_temp/adffd08f-4f9b-4d55-887d-ad41795cbad6/terraform-bin plan -refresh=false -no-color -out=plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t2-oasys-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t2-oasys"
      + runbook_name            = "start-vms"
      + schedule_name           = "weekdays 6am"
    }

  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] must be replaced
-/+ resource "azurerm_automation_job_schedule" "job_schedules" {
      ~ id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/jobSchedules/0f6cd5f7-f35c-4b4b-8b48-8c37d0b58f9a" -> (known after apply)
      ~ job_schedule_id         = "0f6cd5f7-f35c-4b4b-8b48-8c37d0b58f9a" -> (known after apply)
      - parameters              = {
          - "exceptions_string" = "T2ODL0009 T2OML0007"
        } -> null # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
      ~ content                 = <<-EOT
            workflow start-vms
          - {
          -    
          + {    
                # vars
                $resourceGroup   = "t2-oasys"
                
                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation
                Connect-AzureRMAccount -Identity
            
                # get vm list
          -     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup # | project name, tags.shutdown_exclude | where tags_shutdown_exclude != true).Name
          +     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup
                
                # remove exceptions from vm list by shutdown_exclude tag
          -     $vms_to_handle =  InlineScript {
          +     $vms_to_handle = InlineScript {
                    $vms_in_rg = $using:vms_in_rg
                    $vms_to_handle = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_in_rg) {
                        if ($vm.Tags.shutdown_exclude -ne 'true') {
                            $vms_to_handle += $vm.Name
                        } else {
                            Write-Output "Excluding $($vm.Name)"
                        }
                    }
                    return $vms_to_handle
                }
            
                Write-Output 'VM list:'
                Write-Output $vms_to_handle
            
                # iterate over vms
                foreach -parallel ($vm in $vms_to_handle) 
                { 
                    # start vm
                    Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm
            
                    # update monitoring tag
                    $tags  = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                    $new_tags = InlineScript {
                        $new_tags = $Using:tags
                        $new_tags.not_monitored = "false"
                        return $new_tags
                    }
                    Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $new_tags -Force 
                }
            }
          - 
        EOT
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/start-vms"
        name                    = "start-vms"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
      ~ content                 = <<-EOT
            workflow stop-vms
            {
          -     Param 
          -     (    
          -         [String] 
          -         $exceptions_string = ''
          -     ) 
          -     
                # vars
                $resourceGroup   = "t2-oasys"
          -     $exceptions_list = ($exceptions_string).split(" ")
                
                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation
                Connect-AzureRMAccount -Identity
            
                # get vm list
          -     $vms_in_rg = (Get-AzureRmVM -ResourceGroupName $resourceGroup).Name 
          +     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup
                
          -     # remove exceptions from vm list
          +     # remove exceptions from vm list by shutdown_exclude tag
                $vms_to_handle = InlineScript {
                    $vms_in_rg = $using:vms_in_rg
          -         $exceptions_list = $using:exceptions_list
                    $vms_to_handle = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_in_rg) {
          -             if ($exceptions_list -notcontains $vm) {
          -                 $vms_to_handle += $vm
          +             if ($vm.Tags.shutdown_exclude -ne 'true') {
          +                 $vms_to_handle += $vm.Name
          +             } else {
          +                 Write-Output "Excluding $($vm.Name)"
                        }
                    }
                    return $vms_to_handle
                }
          + 
                Write-Output 'VM list:'
                Write-Output $vms_to_handle
            
                # iterate over vms
                foreach -parallel ($vm in $vms_to_handle) 
                {
                    # update monitoring tag if it exists
                    $tags  = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                    $new_tags = InlineScript {
                        $new_tags = $Using:tags
                        $new_tags.not_monitored = "true"
                        return $new_tags
                    }
                    Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $new_tags -Force 
            
                    # stop vm
                    Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force
                }
            }
        EOT
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/stop-vms"
        name                    = "stop-vms"
        tags                    = {}
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] must be replaced%0A-/+ resource "azurerm_automation_job_schedule" "job_schedules" {%0A      ~ id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/jobSchedules/0f6cd5f7-f35c-4b4b-8b48-8c37d0b58f9a" -> (known after apply)%0A      ~ job_schedule_id         = "0f6cd5f7-f35c-4b4b-8b48-8c37d0b58f9a" -> (known after apply)%0A      - parameters              = {%0A          - "exceptions_string" = "T2ODL0009 T2OML0007"%0A        } -> null # forces replacement%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A      ~ content                 = <<-EOT%0A            workflow start-vms%0A          - {%0A          -    %0A          + {    %0A                # vars%0A                $resourceGroup   = "t2-oasys"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A          -     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup # | project name, tags.shutdown_exclude | where tags_shutdown_exclude != true).Name%0A          +     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A          -     $vms_to_handle =  InlineScript {%0A          +     $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm.Name%0A                        } else {%0A                            Write-Output "Excluding $($vm.Name)"%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A            %0A                Write-Output 'VM list:'%0A                Write-Output $vms_to_handle%0A            %0A                # iterate over vms%0A                foreach -parallel ($vm in $vms_to_handle) %0A                { %0A                    # start vm%0A                    Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                    # update monitoring tag%0A                    $tags  = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                    $new_tags = InlineScript {%0A                        $new_tags = $Using:tags%0A                        $new_tags.not_monitored = "false"%0A                        return $new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $new_tags -Force %0A                }%0A            }%0A          - %0A        EOT%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/start-vms"%0A        name                    = "start-vms"%0A        tags                    = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A      ~ content                 = <<-EOT%0A            workflow stop-vms%0A            {%0A          -     Param %0A          -     (    %0A          -         [String] %0A          -         $exceptions_string = ''%0A          -     ) %0A          -     %0A                # vars%0A                $resourceGroup   = "t2-oasys"%0A          -     $exceptions_list = ($exceptions_string).split(" ")%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A          -     $vms_in_rg = (Get-AzureRmVM -ResourceGroupName $resourceGroup).Name %0A          +     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A          -     # remove exceptions from vm list%0A          +     # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A          -         $exceptions_list = $using:exceptions_list%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A          -             if ($exceptions_list -notcontains $vm) {%0A          -                 $vms_to_handle += $vm%0A          +             if ($vm.Tags.shutdown_exclude -ne 'true') {%0A          +                 $vms_to_handle += $vm.Name%0A          +             } else {%0A          +                 Write-Output "Excluding $($vm.Name)"%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A          + %0A                Write-Output 'VM list:'%0A                Write-Output $vms_to_handle%0A            %0A                # iterate over vms%0A                foreach -parallel ($vm in $vms_to_handle) %0A                {%0A                    # update monitoring tag if it exists%0A                    $tags  = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                    $new_tags = InlineScript {%0A                        $new_tags = $Using:tags%0A                        $new_tags.not_monitored = "true"%0A                        return $new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $new_tags -Force %0A            %0A                    # stop vm%0A                    Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force%0A                }%0A            }%0A        EOT%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/stop-vms"%0A        name                    = "stop-vms"%0A        tags                    = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 2 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t2-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t2-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_job_schedule.job_schedules["1"] must be replaced%0A-/+ resource "azurerm_automation_job_schedule" "job_schedules" {%0A      ~ id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/jobSchedules/0f6cd5f7-f35c-4b4b-8b48-8c37d0b58f9a" -> (known after apply)%0A      ~ job_schedule_id         = "0f6cd5f7-f35c-4b4b-8b48-8c37d0b58f9a" -> (known after apply)%0A      - parameters              = {%0A          - "exceptions_string" = "T2ODL0009 T2OML0007"%0A        } -> null # forces replacement%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A      ~ content                 = <<-EOT%0A            workflow start-vms%0A          - {%0A          -    %0A          + {    %0A                # vars%0A                $resourceGroup   = "t2-oasys"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A          -     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup # | project name, tags.shutdown_exclude | where tags_shutdown_exclude != true).Name%0A          +     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A          -     $vms_to_handle =  InlineScript {%0A          +     $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm.Name%0A                        } else {%0A                            Write-Output "Excluding $($vm.Name)"%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A            %0A                Write-Output 'VM list:'%0A                Write-Output $vms_to_handle%0A            %0A                # iterate over vms%0A                foreach -parallel ($vm in $vms_to_handle) %0A                { %0A                    # start vm%0A                    Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                    # update monitoring tag%0A                    $tags  = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                    $new_tags = InlineScript {%0A                        $new_tags = $Using:tags%0A                        $new_tags.not_monitored = "false"%0A                        return $new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $new_tags -Force %0A                }%0A            }%0A          - %0A        EOT%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/start-vms"%0A        name                    = "start-vms"%0A        tags                    = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A      ~ content                 = <<-EOT%0A            workflow stop-vms%0A            {%0A          -     Param %0A          -     (    %0A          -         [String] %0A          -         $exceptions_string = ''%0A          -     ) %0A          -     %0A                # vars%0A                $resourceGroup   = "t2-oasys"%0A          -     $exceptions_list = ($exceptions_string).split(" ")%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A          -     $vms_in_rg = (Get-AzureRmVM -ResourceGroupName $resourceGroup).Name %0A          +     $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A          -     # remove exceptions from vm list%0A          +     # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A          -         $exceptions_list = $using:exceptions_list%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A          -             if ($exceptions_list -notcontains $vm) {%0A          -                 $vms_to_handle += $vm%0A          +             if ($vm.Tags.shutdown_exclude -ne 'true') {%0A          +                 $vms_to_handle += $vm.Name%0A          +             } else {%0A          +                 Write-Output "Excluding $($vm.Name)"%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A          + %0A                Write-Output 'VM list:'%0A                Write-Output $vms_to_handle%0A            %0A                # iterate over vms%0A                foreach -parallel ($vm in $vms_to_handle) %0A                {%0A                    # update monitoring tag if it exists%0A                    $tags  = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                    $new_tags = InlineScript {%0A                        $new_tags = $Using:tags%0A                        $new_tags.not_monitored = "true"%0A                        return $new_tags%0A                    }%0A                    Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $new_tags -Force %0A            %0A                    # stop vm%0A                    Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force%0A                }%0A            }%0A        EOT%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/stop-vms"%0A        name                    = "stop-vms"%0A        tags                    = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 2 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::set-output name=stderr::
::set-output name=exitcode::0
```